astb_relise/src/Documents/УстановкаУсловийРаботыСотрудника/УстановкаУсловийРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаУсловийРаботыСотрудника</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>InformationRegister.ДоступныеУсловияРаботыСотрудника</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияРаботы</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиИПрофессии</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаАСТБ</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>CatalogRef.УсловияНорм</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/InformationRegisters/УстановленныеНормыВыдачиСИЗ/УстановленныеНормыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановленныеНормыВыдачиСИЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеНормы</name>
    <type>
      <types>CatalogRef.УсловияНорм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/ТипыУсловийНорм/ТипыУсловийНорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУсловийНорм</name>
  <enumValues>
    <name>Всегда</name>
  </enumValues>
  <enumValues>
    <name>ЗимойДополнительно</name>
  </enumValues>
  <enumValues>
    <name>ПриУсловии</name>
  </enumValues>
  <enumValues>
    <name>ПриУсловииЗимойДополнительно</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Catalogs/УсловияНорм/УсловияНорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УсловияНорм</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипУсловия</name>
    <type>
      <types>EnumRef.ТипыУсловийНорм</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаУсловия</name>
    <type>
      <types>CatalogRef.ГруппыУсловийНорм</types>
    </type>
  </attributes>
</mdclass:Catalog>

astb_relise/src/Catalogs/Подразделения/Подразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Подразделения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.ВидыЭкономическойДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Documents/УстановкаУсловийРаботыСотрудника/Forms/ФормаУстановкиУсловий/Module.bsl
//***НСК Трегубов А.А.*** -- №90515  --  28.06.2021

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация 	  = Параметры.Организация;
	ДокументОснование = Параметры.ДокументОснование;
	ВидВыдачиСИЗ      = Параметры.ВидВыдачиСИЗ;
	
	НеВыводитьУсловиеВсегда		 = Истина;
	НеВыводитьУсловиеВсегдаЗимой = Истина;
	
	СписокСотрудников.ЗагрузитьЗначения(Параметры.МассивСотрудников);
		
	СформироватьДеревоУсловий();		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьКартинкиВДереве();
	РазвернутьДеревоОдногоУзла();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	СоответствиеСозданныхДокументов = СформироватьДокументыНаСервере();
	Если СоответствиеСозданныхДокументов.Количество() <> 0 Тогда
		
		Закрыть(СоответствиеСозданныхДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУзел(Команда)
	
	ТекущиеДанные = Элементы.ДеревоУсловий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма,"ДеревоУсловий",ТекущиеДанные.ПолучитьИдентификатор(),Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьУзел(Команда)
	
	ТекущиеДанные = Элементы.ДеревоУсловий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Элементы.ДеревоУсловий.Свернуть(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидВыдачиПриИзменении(Элемент)

	СформироватьДеревоУсловий();
	УстановитьКартинкиВДереве();
	РазвернутьДеревоОдногоУзла();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловийПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоУсловий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоУзелСУсловием Тогда 
		
		СтруктураПоиска = Новый Структура("Сотрудник,Условие",ТекущиеДанные.Сотрудник,ТекущиеДанные.СотрудникГруппаУсловияУсловие);
		
		МассивНайденныхСтрок = ТаблицаУсловий.НайтиСтроки(СтруктураПоиска);
		Для Каждого НайденнаяСтрока из МассивНайденныхСтрок Цикл
			
			НайденнаяСтрока.ИспользоватьПосле = ТекущиеДанные.Использовать;			
			НайденнаяСтрока.УсловиеМодицифировано = (НайденнаяСтрока.ИспользоватьДо <> НайденнаяСтрока.ИспользоватьПосле);
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьКартинкиВДеревеПоСтроке(ТекущиеДанные);	

КонецПроцедуры

&НаКлиенте
Процедура НеВыводитьУсловиеВсегдаПриИзменении(Элемент)
	
	СформироватьДеревоУсловий();
	УстановитьКартинкиВДереве();
	РазвернутьДеревоОдногоУзла();
	
КонецПроцедуры

&НаКлиенте
Процедура НеВыводитьУсловиеВсегдаВЗимнееВремяПриИзменении(Элемент)
	
	СформироватьДеревоУсловий();
	УстановитьКартинкиВДереве();
	РазвернутьДеревоОдногоУзла();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДеревоУсловий()
	
	ОбъектДерева = РеквизитФормыВЗначение("ДеревоУсловий");
	ОбъектДерева.Строки.Очистить();
	
	МассивСотрудников = СписокСотрудников.ВыгрузитьЗначения();
	
	ТаблицаУстановленныхУсловий = Документы.УстановкаУсловийРаботыСотрудника.ПолучитьУсловияРаботыСотрудников(МассивСотрудников,ДокументОснование.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВТ_ТаблицаУстановленныхУсловий.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник,
	|	ВТ_ТаблицаУстановленныхУсловий.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаУстановленныхУсловий.Должность КАК Должность,
	|	ВЫРАЗИТЬ(ВТ_ТаблицаУстановленныхУсловий.Условие КАК Справочник.УсловияНорм) КАК Условие,
	|	ВТ_ТаблицаУстановленныхУсловий.РабочееМесто КАК РабочееМесто,
	|	ВТ_ТаблицаУстановленныхУсловий.Использовать КАК Использовать
	|ПОМЕСТИТЬ ВТ_УстановленныеУсловия
	|ИЗ
	|	&ТаблицаУстановленныхУсловий КАК ВТ_ТаблицаУстановленныхУсловий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_УстановленныеУсловия.Сотрудник КАК Сотрудник,
	|	ВТ_УстановленныеУсловия.Условие КАК Условие,
	|	ВТ_УстановленныеУсловия.Использовать КАК Использовать
	|ПОМЕСТИТЬ ВТ_Свод
	|ИЗ
	|	ВТ_УстановленныеУсловия КАК ВТ_УстановленныеУсловия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеНормыВыдачиСИЗ.СрезПоследних(
	|				&ПериодРасчета,
	|				Организация = &Организация
	|					И ВЫБОР
	|						КОГДА &ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ НормаВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|					КОНЕЦ
	|					И (Должность, РабочееМесто) В
	|						(ВЫБРАТЬ
	|							ВТ_УстановленныеУсловия.Должность,
	|							ВТ_УстановленныеУсловия.РабочееМесто
	|						ИЗ
	|							ВТ_УстановленныеУсловия КАК ВТ_УстановленныеУсловия)) КАК УстановленныеНормыВыдачиСИЗСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА УстановленныеНормыВыдачиСИЗСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ УстановленныеНормыВыдачиСИЗСрезПоследних.Подразделение = ВТ_УстановленныеУсловия.Подразделение
	|			КОНЕЦ)
	|			И ВТ_УстановленныеУсловия.Должность = УстановленныеНормыВыдачиСИЗСрезПоследних.Должность
	|			И ВТ_УстановленныеУсловия.РабочееМесто = УстановленныеНормыВыдачиСИЗСрезПоследних.РабочееМесто
	|			И ВТ_УстановленныеУсловия.Условие = УстановленныеНормыВыдачиСИЗСрезПоследних.УсловиеНормы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НеВыводитьУсловиеВсегда
	|				ТОГДА ВТ_УстановленныеУсловия.Условие.ТипУсловия <> ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.Всегда)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НеВыводитьУсловиеВсегдаЗимой
	|				ТОГДА ВТ_УстановленныеУсловия.Условие.ТипУсловия <> ЗНАЧЕНИЕ(Перечисление.ТипыУсловийНорм.ЗимойДополнительно)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Свод.Сотрудник КАК Сотрудник,
	|	ВТ_Свод.Условие КАК Условие,
	|	ВТ_Свод.Использовать КАК ИспользоватьДо
	|ИЗ
	|	ВТ_Свод КАК ВТ_Свод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Свод.Сотрудник КАК Сотрудник,
	|	ВТ_Свод.Условие КАК Условие,
	|	ВТ_Свод.Использовать КАК Использовать,
	|	ВТ_Свод.Условие.ГруппаУсловия КАК ГруппаУсловия
	|ИЗ
	|	ВТ_Свод КАК ВТ_Свод
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Свод.Сотрудник.Наименование,
	|	ВТ_Свод.Условие.Наименование
	|ИТОГИ ПО
	|	Сотрудник,
	|	ГруппаУсловия";
	
	Запрос.УстановитьПараметр("ТаблицаУстановленныхУсловий",ТаблицаУстановленныхУсловий);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",ВидВыдачиСИЗ);
	Запрос.УстановитьПараметр("ПериодРасчета",ДокументОснование.Дата);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("НеВыводитьУсловиеВсегда",НеВыводитьУсловиеВсегда);
	Запрос.УстановитьПараметр("НеВыводитьУсловиеВсегдаЗимой",НеВыводитьУсловиеВсегдаЗимой);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаУсловий.Загрузить(РезультатЗапроса[2].Выгрузить());
	
	ВыборкаСотрудник = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаСотрудник.Следующий() Цикл
		
		Узел1 = ОбъектДерева.Строки.Добавить();
		Узел1.СотрудникГруппаУсловияУсловие = ВыборкаСотрудник.Сотрудник;
		Узел1.КорневойУзел = Истина;
		
		ВыборкаГруппаУсловия = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаГруппаУсловия.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаГруппаУсловия.ГруппаУсловия) Тогда 
				
				Узел2 = Узел1.Строки.Добавить();
				Узел2.СотрудникГруппаУсловияУсловие = ВыборкаГруппаУсловия.ГруппаУсловия;
				
			Иначе
				Узел2 = Узел1;
			КонецЕсли;
	
			Выборка = ВыборкаГруппаУсловия.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Узел3 = Узел2.Строки.Добавить();
				Узел3.СотрудникГруппаУсловияУсловие = Выборка.Условие;
				Узел3.Сотрудник = Выборка.Сотрудник;
				Узел3.Использовать = Выборка.Использовать;
				Узел3.ЭтоУзелСУсловием = Истина;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
		
	ЗначениеВРеквизитФормы(ОбъектДерева,"ДеревоУсловий");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкиВДеревеПоСтроке(СтрокаДерева) 
	
	Если ТипЗнч(СтрокаДерева.СотрудникГруппаУсловияУсловие) = Тип("СправочникСсылка.УсловияНорм") Тогда 
		
		Узел2 = СтрокаДерева.ПолучитьРодителя();
		Если ТипЗнч(Узел2.СотрудникГруппаУсловияУсловие) = Тип("СправочникСсылка.ГруппыУсловийНорм") Тогда 
			
			//Уровень с сотрудником
			Узел1 = Узел2.ПолучитьРодителя();
		Иначе
			Узел1 = Узел2;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СтрокаДерева.СотрудникГруппаУсловияУсловие) = Тип("СправочникСсылка.ГруппыУсловийНорм") Тогда
		
		//Уровень с сотрудником
		Узел1 = СтрокаДерева.ПолучитьРодителя();
		
	Иначе
		
		//Уровень с сотрудником
		Узел1 = СтрокаДерева;
		
	КонецЕсли;
	
	//если неверно распарсили
	Если ТипЗнч(Узел1.СотрудникГруппаУсловияУсловие) <> Тип("СправочникСсылка.Сотрудники") Тогда 
		Возврат;
	КонецЕсли;
		
	ЕстьУзлыСНесколькимиВключеннымиУсловиями = Ложь;
	ЕстьУзлыСГруппойУсловий = Ложь;
	
	Узел2 = Узел1.ПолучитьЭлементы();	
	Для Каждого ЭлементУзла2 из Узел2 Цикл 
		
		Если ТипЗнч(ЭлементУзла2.СотрудникГруппаУсловияУсловие) = Тип("СправочникСсылка.ГруппыУсловийНорм") Тогда 
			
			ЕстьУзлыСГруппойУсловий = Истина;
			КоличествоВключенныхУсловийУзла = 0;
						
			Узел3 = ЭлементУзла2.ПолучитьЭлементы();
			Для Каждого ЭлементУзла3 из Узел3 Цикл 				
				
				ЭлементУзла3.ИндексКартинки = 32;
				
				КоличествоВключенныхУсловийУзла = КоличествоВключенныхУсловийУзла + ?(ЭлементУзла3.Использовать,1,0);
				
			КонецЦикла;
			
			Если КоличествоВключенныхУсловийУзла > 1 Тогда
				
				ЕстьУзлыСНесколькимиВключеннымиУсловиями = Истина;
				
				ЭлементУзла2.ИндексКартинки = 0;
			Иначе
				ЭлементУзла2.ИндексКартинки = 5;
			КонецЕсли;

			
		Иначе
			
			//это узел с условием
			ЭлементУзла2.ИндексКартинки = 32;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьУзлыСНесколькимиВключеннымиУсловиями Тогда 
		Узел1.ИндексКартинки = 6;
	ИначеЕсли ЕстьУзлыСГруппойУсловий Тогда 
		Узел1.ИндексКартинки = 5;
	иначе
		Узел1.ИндексКартинки = 3;			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкиВДереве()

	Для Каждого ЭлементДерева из ДеревоУсловий.ПолучитьЭлементы() Цикл 		
		УстановитьКартинкиВДеревеПоСтроке(ЭлементДерева);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоОдногоУзла()
	
	ЭлементыКорневогоУзла = ДеревоУсловий.ПолучитьЭлементы();
	Если ЭлементыКорневогоУзла.Количество() = 1 Тогда
		
		СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма,"ДеревоУсловий",ЭлементыКорневогоУзла[0].ПолучитьИдентификатор(),Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьДокументыНаСервере()
	
	СоответствиеСозданныхДокументов = Новый Соответствие;
	
	Попытка
		
		МассивСотрудников = СписокСотрудников.ВыгрузитьЗначения();		
		ТаблицаВсехУсловий = Документы.УстановкаУсловийРаботыСотрудника.ПолучитьУсловияРаботыСотрудников(МассивСотрудников,ДокументОснование.Дата);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзмененныхУсловий.Сотрудник КАК Сотрудник,
		|	ТаблицаИзмененныхУсловий.Условие КАК Условие,
		|	ТаблицаИзмененныхУсловий.ИспользоватьПосле КАК Использовать,
		|	ТаблицаИзмененныхУсловий.УсловиеМодицифировано КАК УсловиеМодифицировано
		|ПОМЕСТИТЬ ВТ_ТалицаУсловийОбработки
		|ИЗ
		|	&ТаблицаИзмененныхУсловий КАК ТаблицаИзмененныхУсловий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаИзмененныхУсловий.Сотрудник КАК Сотрудник,
		|	ВТ_ТаблицаИзмененныхУсловий.Условие КАК Условие,
		|	ВТ_ТаблицаИзмененныхУсловий.Использовать КАК Использовать,
		|	ВТ_ТаблицаИзмененныхУсловий.УсловиеМодифицировано КАК УсловиеМодифицировано
		|ПОМЕСТИТЬ ВТ_МодифицированныеУсловия
		|ИЗ
		|	ВТ_ТалицаУсловийОбработки КАК ВТ_ТаблицаИзмененныхУсловий
		|ГДЕ
		|	ВТ_ТаблицаИзмененныхУсловий.УсловиеМодифицировано
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВсехУсловий.Сотрудник КАК Сотрудник,
		|	ТаблицаВсехУсловий.Подразделение КАК Подразделение,
		|	ТаблицаВсехУсловий.Должность КАК Должность,
		|	ТаблицаВсехУсловий.Условие КАК Условие,
		|	ТаблицаВсехУсловий.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТ_ВсеУсловия
		|ИЗ
		|	&ТаблицаВсехУсловий КАК ТаблицаВсехУсловий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаВсехУсловий.Сотрудник КАК Сотрудник,
		|	ВТ_ТаблицаВсехУсловий.Подразделение КАК Подразделение,
		|	ВТ_ТаблицаВсехУсловий.Должность КАК Должность,
		|	ВТ_ТаблицаВсехУсловий.Условие КАК Условие,
		|	ВТ_ТаблицаВсехУсловий.РабочееМесто КАК РабочееМесто,
		|	ВТ_МодифицированныеУсловия.Использовать КАК Использовать
		|ИЗ
		|	ВТ_МодифицированныеУсловия КАК ВТ_МодифицированныеУсловия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеУсловия КАК ВТ_ТаблицаВсехУсловий
		|		ПО ВТ_МодифицированныеУсловия.Сотрудник = ВТ_ТаблицаВсехУсловий.Сотрудник
		|			И ВТ_МодифицированныеУсловия.Условие = ВТ_ТаблицаВсехУсловий.Условие
		|ИТОГИ ПО
		|	Сотрудник";
		
		Запрос.УстановитьПараметр("ТаблицаИзмененныхУсловий",ТаблицаУсловий.Выгрузить());
		Запрос.УстановитьПараметр("ТаблицаВсехУсловий",ТаблицаВсехУсловий);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаСотрудник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСотрудник.Следующий() Цикл 
			
			НачатьТранзакцию();
			
			ДокументОбъект = Документы.УстановкаУсловийРаботыСотрудника.СоздатьДокумент();
			ДокументОбъект.Дата = ДокументОснование.Дата - 1;
			ДокументОбъект.ДокументОснование = ДокументОснование;
			ДокументОбъект.Организация = Организация;
			ДокументОбъект.Сотрудник = ВыборкаСотрудник.Сотрудник;
			ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
			ДокументОбъект.СоздательДокумента = Пользователи.ТекущийПользователь();
			ДокументОбъект.Комментарий = "#Создан на основании выдачи №" + ДокументОснование.Номер + " от " + ДокументОснование.Дата; 
			
			Выборка = ВыборкаСотрудник.Выбрать();
			Пока Выборка.Следующий() Цикл 
				
				СтрокаТабличнойЧасти = ДокументОбъект.УсловияРаботы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,Выборка);
				
			КонецЦикла;
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			СоответствиеСозданныхДокументов.Вставить(ВыборкаСотрудник.Сотрудник,ДокументОбъект.Ссылка);
			
			ЗафиксироватьТранзакцию();
			
		КонецЦикла;	
		
	Исключение
		
		Если ТранзакцияАктивна() Тогда 
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат СоответствиеСозданныхДокументов;
	
КонецФункции

#КонецОбласти
